In [10]:
import pandas as pd

import os
os.getcwd()
cwd =os.getcwd()
cwd

'C:\\Users\\David\\Documents\\Data Bootcamp\\Module 4\\school_district_analysis'

In [11]:
school_data_to_load = "Resources/schools_complete.csv"

In [12]:
student_data_to_load = "Resources/students_complete.csv"

In [18]:
school_df = pd.read_csv(school_data_to_load)
school_df.index

RangeIndex(start=0, stop=15, step=1)

In [21]:
student_df = pd.read_csv(student_data_to_load)
student_df.index

RangeIndex(start=0, stop=39170, step=1)

In [23]:
student_df.head(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60

In [24]:
student_df.tail(3)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75